IDEA Open Model
CrossSectionFactory.FillWelded2Uc Method
Compatible with IDEA StatiCa Beta 20.0
 Fill steel section Channel shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public static void FillWelded2Uc(
	CrossSectionParameter cssO,
	string name,
	double Distance
)
Public Shared Sub FillWelded2Uc (
	cssO As CrossSectionParameter,
	name As String,
	Distance As Double
)
Parameters
cssO
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
name
Type: System.String
Name
Distance
Type: System.Double
Distance
Return Value
Type:
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace